[
  {
    "title": "If [Everyday Activity] Had Boss Levels",
    "description": "Comedy skit showing ordinary activities like grocery shopping or doing laundry as increasingly difficult video game levels. Expand with creative obstacles, power-ups, and final boss encounters.",
    "tags": ["comedy", "skits", "gaming", "everyday life"],
    "niches": ["comedy", "entertainment"]
  },
  {
    "title": "Adult Problems Solved by Kid Logic",
    "description": "Sketch where children offer hilariously simple solutions to complex adult problems like taxes, relationships, and career choices. Expand with innocent perspectives and unexpected wisdom.",
    "tags": ["comedy", "skits", "kids", "adults"],
    "niches": ["comedy", "family"]
  },
  {
    "title": "Dating App Profiles in Real Life",
    "description": "Comedy skit showing how people would behave if they acted exactly like their dating app profiles in person. Expand with exaggerated hobbies, filtered appearances, and awkward interactions.",
    "tags": ["comedy", "skits", "dating", "social media"],
    "niches": ["comedy", "lifestyle"]
  },
  {
    "title": "If Your Pet Could Text You",
    "description": "Sketch showing what your pets would text throughout the day based on their behavior. Expand with different pet personalities, urgent food requests, and jealousy over other pets.",
    "tags": ["comedy", "skits", "pets", "texting"],
    "niches": ["comedy", "pets"]
  },
  {
    "title": "Customer Service for Life Decisions",
    "description": "Comedy skit about calling customer service to complain about life choices and asking for refunds or exchanges. Expand with hold music, transfer departments, and unhelpful representatives.",
    "tags": ["comedy", "skits", "customer service", "life"],
    "niches": ["comedy", "lifestyle"]
  },
  {
    "title": "If Social Media Reactions Were Real Life",
    "description": "Sketch showing people physically performing social media actions like literally 'liking' something or 'sharing' by handing items to others. Expand with comment sections and emoji reactions.",
    "tags": ["comedy", "skits", "social media", "reactions"],
    "niches": ["comedy", "technology"]
  },
  {
    "title": "Parents vs. Technology Support",
    "description": "Comedy skit about parents calling their kids for tech support with increasingly ridiculous problems. Expand with password issues, mysterious disappearing icons, and impossible explanations.",
    "tags": ["comedy", "skits", "parents", "technology"],
    "niches": ["comedy", "family"]
  },
  {
    "title": "If Netflix Had a Therapy Session",
    "description": "Sketch where Netflix discusses its issues with a therapist, including commitment problems with shows and suggesting the same content repeatedly. Expand with other streaming service rivalries.",
    "tags": ["comedy", "skits", "Netflix", "therapy"],
    "niches": ["comedy", "entertainment"]
  },
  {
    "title": "Honest Gym Equipment Reviews",
    "description": "Comedy skit featuring gym equipment giving brutally honest reviews of their users. Expand with treadmill complaints, weight bench observations, and elliptical machine gossip.",
    "tags": ["comedy", "skits", "gym", "fitness"],
    "niches": ["comedy", "fitness"]
  },
  {
    "title": "If Your Brain Had Customer Reviews",
    "description": "Sketch showing customer reviews for your brain's performance in different situations. Expand with one-star reviews for Monday mornings and five-star reviews for random 3am thoughts.",
    "tags": ["comedy", "skits", "brain", "reviews"],
    "niches": ["comedy", "lifestyle"]
  },
  {
    "title": "Job Interview for Being an Adult",
    "description": "Comedy skit about interviewing for the position of 'adult' with questions about taxes, cooking, and maintaining plants alive. Expand with reference checks and skill assessments.",
    "tags": ["comedy", "skits", "adulting", "job interview"],
    "niches": ["comedy", "lifestyle"]
  },
  {
    "title": "If Food Had Feelings",
    "description": "Sketch showing food items discussing their fate in the refrigerator, forming alliances, and trying to avoid expiration. Expand with personality-based humor and food hierarchy politics.",
    "tags": ["comedy", "skits", "food", "feelings"],
    "niches": ["comedy", "food"]
  },
  {
    "title": "Zoom Meeting Personalities Explained",
    "description": "Comedy skit categorizing different types of people in video calls - the muter, the background show-off, the technical difficulty person. Expand with exaggerated characteristics and interactions.",
    "tags": ["comedy", "skits", "Zoom", "work"],
    "niches": ["comedy", "work"]
  },
  {
    "title": "If Anxiety Was a Personal Assistant",
    "description": "Sketch showing anxiety as an overly helpful assistant that reminds you of everything that could go wrong. Expand with scheduling worry sessions and providing worst-case scenario reports.",
    "tags": ["comedy", "skits", "anxiety", "mental health"],
    "niches": ["comedy", "health"]
  },
  {
    "title": "Honest Weather App Updates",
    "description": "Comedy skit featuring a weather app that gives brutally honest forecasts about ruined plans and outfit failures. Expand with passive-aggressive notifications and mood predictions.",
    "tags": ["comedy", "skits", "weather", "apps"],
    "niches": ["comedy", "technology"]
  },
  {
    "title": "If Your Car Could Rate Your Driving",
    "description": "Sketch where cars give performance reviews of their drivers' skills, including parallel parking attempts and highway merging anxiety. Expand with passenger testimonials and driving instructor feedback.",
    "tags": ["comedy", "skits", "cars", "driving"],
    "niches": ["comedy", "lifestyle"]
  },
  {
    "title": "Millennial vs. Gen Z Translation Service",
    "description": "Comedy skit about a translation service helping different generations understand each other's slang and references. Expand with cultural confusion and technology gaps.",
    "tags": ["comedy", "skits", "generations", "culture"],
    "niches": ["comedy", "culture"]
  },
  {
    "title": "If Your Clothes Could Complain",
    "description": "Sketch showing clothes discussing their treatment - being worn repeatedly, ignored in the closet, or subjected to questionable outfit combinations. Expand with fashion intervention attempts.",
    "tags": ["comedy", "skits", "clothes", "fashion"],
    "niches": ["comedy", "fashion"]
  },
  {
    "title": "Grocery Store Items Fight for Cart Space",
    "description": "Comedy skit about grocery items competing to be chosen and arguing about their nutritional value versus taste appeal. Expand with sale item advantages and healthy food peer pressure.",
    "tags": ["comedy", "skits", "grocery", "shopping"],
    "niches": ["comedy", "food"]
  },
  {
    "title": "If Sleep Had Terms and Conditions",
    "description": "Sketch showing the fine print of sleep agreements, including penalties for caffeine consumption and clauses about weird dreams. Expand with customer service complaints about insomnia.",
    "tags": ["comedy", "skits", "sleep", "terms conditions"],
    "niches": ["comedy", "lifestyle"]
  }
]