[
  {
    "title": "Everyday Situations That Become Comedy Gold",
    "description": "Transform mundane daily activities into hilarious comedy content by exaggerating common frustrations and awkward moments. Expand with relatable scenarios everyone experiences.",
    "tags": ["comedy", "everyday life", "relatable", "humor"],
    "niches": ["comedy", "lifestyle"]
  },
  {
    "title": "Funny Observations About Modern Life",
    "description": "Commentary on the absurdities of contemporary living - from smartphone addiction to social media culture. Expand with witty takes on current trends and technology.",
    "tags": ["comedy", "observations", "modern life", "social commentary"],
    "niches": ["comedy", "culture"]
  },
  {
    "title": "Comedy Roasts of Inanimate Objects",
    "description": "Hilariously criticize everyday objects for their design flaws and annoying features. Expand with personified complaints from furniture, appliances, and tools.",
    "tags": ["comedy", "roasts", "objects", "personification"],
    "niches": ["comedy", "entertainment"]
  },
  {
    "title": "Parody Songs About Daily Struggles",
    "description": "Create funny versions of popular songs about common problems like traffic jams, Monday mornings, or running out of coffee. Expand with clever lyrics and music video elements.",
    "tags": ["comedy", "parody", "music", "daily life"],
    "niches": ["comedy", "music"]
  },
  {
    "title": "Impersonations of Different Types of People",
    "description": "Comedy impressions of various personality types - the gym enthusiast, the picky eater, the social media influencer. Expand with exaggerated characteristics and catchphrases.",
    "tags": ["comedy", "impersonations", "characters", "stereotypes"],
    "niches": ["comedy", "entertainment"]
  },
  {
    "title": "Funny Product Reviews for Ridiculous Items",
    "description": "Create comedic reviews for absurd or poorly designed products, treating them with serious analysis. Expand with demonstrations, pros and cons lists, and customer testimonials.",
    "tags": ["comedy", "product reviews", "satire", "consumer"],
    "niches": ["comedy", "reviews"]
  },
  {
    "title": "Comedy Commentary on Childhood vs. Adulthood",
    "description": "Humorous comparisons between being a kid and being an adult - from excitement about bedtime to dreading bills. Expand with then-and-now scenarios and nostalgic humor.",
    "tags": ["comedy", "childhood", "adulthood", "growing up"],
    "niches": ["comedy", "lifestyle"]
  },
  {
    "title": "Awkward Social Situation Comedy Sketches",
    "description": "Act out uncomfortably funny social scenarios like forgetting someone's name or accidentally waving at the wrong person. Expand with escalating awkwardness and relatable reactions.",
    "tags": ["comedy", "awkward", "social situations", "relatable"],
    "niches": ["comedy", "social"]
  },
  {
    "title": "Funny Interpretations of Common Sayings",
    "description": "Take popular idioms and phrases literally for comedic effect - what if it really rained cats and dogs? Expand with visual gags and unexpected interpretations.",
    "tags": ["comedy", "sayings", "literal", "wordplay"],
    "niches": ["comedy", "wordplay"]
  },
  {
    "title": "Comedy Rants About Pet Peeves",
    "description": "Passionate, exaggerated complaints about minor annoyances like slow walkers, loud chewers, or people who don't use turn signals. Expand with escalating frustration and solutions.",
    "tags": ["comedy", "rants", "pet peeves", "frustration"],
    "niches": ["comedy", "lifestyle"]
  },
  {
    "title": "Funny How-To Guides for Useless Skills",
    "description": "Create instructional comedy videos for completely pointless abilities like how to look busy at work or how to avoid small talk. Expand with step-by-step demonstrations.",
    "tags": ["comedy", "how-to", "useless skills", "parody"],
    "niches": ["comedy", "tutorial"]
  },
  {
    "title": "Comedy Debates About Trivial Topics",
    "description": "Stage serious debates about meaningless subjects like whether cereal is soup or if a hotdog is a sandwich. Expand with passionate arguments and expert witnesses.",
    "tags": ["comedy", "debates", "trivial", "arguments"],
    "niches": ["comedy", "discussion"]
  },
  {
    "title": "Funny Motivational Speaker Parodies",
    "description": "Mock inspirational speakers with hilariously bad advice and over-the-top enthusiasm about mundane topics. Expand with audience interaction and nonsensical success stories.",
    "tags": ["comedy", "motivational", "parody", "speakers"],
    "niches": ["comedy", "business"]
  },
  {
    "title": "Comedy About Different Generations' Technology Use",
    "description": "Humorous takes on how different age groups interact with technology - from grandparents on Facebook to Gen Z on TikTok. Expand with generational stereotypes and confusion.",
    "tags": ["comedy", "generations", "technology", "age gaps"],
    "niches": ["comedy", "technology"]
  },
  {
    "title": "Funny Dating App Profile Translations",
    "description": "Decode what people really mean in their dating profiles with comedic translations of common phrases and photos. Expand with before-and-after reveals and honest interpretations.",
    "tags": ["comedy", "dating", "profiles", "translation"],
    "niches": ["comedy", "dating"]
  },
  {
    "title": "Comedy About Procrastination and Productivity",
    "description": "Humorous takes on the struggle between wanting to be productive and finding creative ways to avoid work. Expand with elaborate procrastination techniques and fake productivity.",
    "tags": ["comedy", "procrastination", "productivity", "work"],
    "niches": ["comedy", "work"]
  },
  {
    "title": "Funny Cooking Show Parodies",
    "description": "Mock cooking shows with disasters, impossible recipes, and overly dramatic hosts. Expand with kitchen mishaps, ingredient substitutions, and judge reactions.",
    "tags": ["comedy", "cooking", "parody", "food"],
    "niches": ["comedy", "food"]
  },
  {
    "title": "Comedy About Exercise and Fitness Fails",
    "description": "Humorous takes on gym culture, workout struggles, and fitness trends. Expand with equipment malfunctions, unrealistic expectations, and post-workout realities.",
    "tags": ["comedy", "exercise", "fitness", "fails"],
    "niches": ["comedy", "fitness"]
  },
  {
    "title": "Funny Weather Forecast Parodies",
    "description": "Create comedy weather reports with brutally honest forecasts about mood impacts and outfit choices. Expand with seasonal depression warnings and weather-related life advice.",
    "tags": ["comedy", "weather", "forecast", "parody"],
    "niches": ["comedy", "lifestyle"]
  },
  {
    "title": "Comedy About Online Shopping Addiction",
    "description": "Humorous takes on the psychology of online shopping - from abandoned carts to impulse purchases at 2am. Expand with delivery anticipation and buyer's remorse scenarios.",
    "tags": ["comedy", "shopping", "online", "addiction"],
    "niches": ["comedy", "lifestyle"]
  }
]